<a href="https://colab.research.google.com/github/thedeveshpareek/ML-Training-assignment/blob/main/Task_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


Task 10

GO_STP_8589

Onehotencoding : A one hot encoding allows the representation of categorical data to be more expressive. Many machine learning algorithms cannot work with categorical data directly. ... When a one hot encoding is used for the output variable, it may offer a more nuanced set of predictions than a single label.

Multicollinearity : Multicollinearity exists whenever an independent variable is highly correlated with one or more of the other independent variables in a multiple regression equation. Multicollinearity is a problem because it undermines the statistical significance of an independent variable.


Dummy variable trap : The Dummy Variable trap is a scenario in which the independent variables are multicollinear - a scenario in which two or more variables are highly correlated; in simple terms one variable can be predicted from the others. To demonstrate the Dummy Variable Trap, take the case of gender (male/female) as an example.

Nominal and ordinal Variables : Nominal data is a group of non-parametric variables, while Ordinal data is a group of non-parametric ordered variables. Although, they are both non-parametric variables, what differentiates them is the fact that ordinal data is placed into some kind of order by their position.

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_table("/content/salary.txt",delim_whitespace=True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [ ]:
df.keys()

Index(['sx', 'rk', 'yr', 'dg', 'yd', 'sl'], dtype='object')

In [ ]:
dummies = pd.get_dummies(df,columns=['sx','rk','dg'])
dummies.head()

   yr  yd     sl  sx_female  ...  rk_associate  rk_full  dg_doctorate  dg_masters
0  25  35  36350          0  ...             0        1             1           0
1  13  22  35350          0  ...             0        1             1           0
2  10  23  28200          0  ...             0        1             1           0
3   7  27  26775          1  ...             0        1             1           0
4  19  30  33696          0  ...             0        1             0           1

[5 rows x 10 columns]

In [ ]:
merge = pd.concat([df,dummies],axis='columns')
merge.head()

       sx    rk  yr         dg  ...  rk_associate  rk_full  dg_doctorate  dg_masters
0    male  full  25  doctorate  ...             0        1             1           0
1    male  full  13  doctorate  ...             0        1             1           0
2    male  full  10  doctorate  ...             0        1             1           0
3  female  full   7  doctorate  ...             0        1             1           0
4    male  full  19    masters  ...             0        1             0           1

[5 rows x 16 columns]

In [ ]:
final = merge.drop(['sx','rk','dg','sx_male','rk_full','dg_masters'],axis='columns')
final.head()

   yr  yd     sl  yr  ...  sx_female  rk_assistant  rk_associate  dg_doctorate
0  25  35  36350  25  ...          0             0             0             1
1  13  22  35350  13  ...          0             0             0             1
2  10  23  28200  10  ...          0             0             0             1
3   7  27  26775   7  ...          1             0             0             1
4  19  30  33696  19  ...          0             0             0             0

[5 rows x 10 columns]

#OneHotEncoding

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [ ]:
newdf = df

newdf.sx = le.fit_transform(newdf.sx)
newdf.rk = le.fit_transform(newdf.rk)
newdf.dg = le.fit_transform(newdf.dg)
newdf.head()

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696

In [ ]:
from sklearn.preprocessing import OneHotEncoder

from sklearn.compose import ColumnTransformer

ct = ColumnTransformer([('encoder',OneHotEncoder(),[0,1,3])],remainder = 'passthrough')

In [ ]:
newct = np.array(ct.fit_transform(df), dtype = str)
newct

array([['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '25.0', '35.0',
        '36350.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '13.0', '22.0',
        '35350.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '10.0', '23.0',
        '28200.0'],
       ['1.0', '0.0', '0.0', '0.0', '1.0', '1.0', '0.0', '7.0', '27.0',
        '26775.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '19.0', '30.0',
        '33696.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '16.0', '21.0',
        '28516.0'],
       ['1.0', '0.0', '0.0', '0.0', '1.0', '0.0', '1.0', '0.0', '32.0',
        '24900.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '16.0', '18.0',
        '31909.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '13.0', '30.0',
        '31850.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '13.0', '31.0',
        '32850.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '12.0', '22.0',
        '27025.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '1.0', '0.0', '15.0', '19.0',
        '24750.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '9.0', '17.0',
        '28200.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '9.0', '27.0',
        '23712.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '9.0', '24.0',
        '25748.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '7.0', '15.0',
        '29342.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '13.0', '20.0',
        '31114.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '11.0', '14.0',
        '24742.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '10.0', '15.0',
        '22906.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '6.0', '21.0',
        '24450.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '0.0', '1.0', '16.0', '23.0',
        '19175.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '8.0', '31.0',
        '20525.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '7.0', '13.0',
        '27959.0'],
       ['1.0', '0.0', '0.0', '0.0', '1.0', '1.0', '0.0', '8.0', '24.0',
        '38045.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '1.0', '0.0', '9.0', '12.0',
        '24832.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '5.0', '18.0',
        '25400.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '1.0', '0.0', '11.0', '14.0',
        '24800.0'],
       ['1.0', '0.0', '0.0', '0.0', '1.0', '1.0', '0.0', '5.0', '16.0',
        '25500.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '3.0', '7.0',
        '26182.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '3.0', '17.0',
        '23725.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '0.0', '1.0', '10.0', '15.0',
        '21600.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '11.0', '31.0',
        '23300.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '0.0', '1.0', '9.0', '14.0',
        '23713.0'],
       ['1.0', '0.0', '0.0', '1.0', '0.0', '0.0', '1.0', '4.0', '33.0',
        '20690.0'],
       ['1.0', '0.0', '0.0', '1.0', '0.0', '0.0', '1.0', '6.0', '29.0',
        '22450.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '1.0', '0.0', '1.0', '9.0',
        '20850.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '8.0', '14.0',
        '18304.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '4.0', '4.0',
        '17095.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '4.0', '5.0',
        '16700.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '4.0', '4.0',
        '17600.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '3.0', '4.0',
        '18075.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '0.0', '1.0', '3.0', '11.0',
        '18000.0'],
       ['0.0', '1.0', '0.0', '1.0', '0.0', '1.0', '0.0', '0.0', '7.0',
        '20999.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '3.0', '3.0',
        '17250.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '2.0', '3.0',
        '16500.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '2.0', '1.0',
        '16094.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '2.0', '6.0',
        '16150.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '2.0', '2.0',
        '15350.0'],
       ['0.0', '1.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '1.0',
        '16244.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '1.0',
        '16686.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '1.0',
        '15000.0'],
       ['1.0', '0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '0.0', '2.0',
        '20300.0']], dtype='<U32')